

let jokes = [
    "مرة واحدة اسمها شمس بلعت سلك بقى اسمها صن سيلك",
    "مرة سباك نفسه اتسدت طلب فيشة تفاح",
    "مرة قنبلة قالت لصاحبتها متنسيش معاد بكرة قالتلها لو نسيت ابقي فجريني",
    "ليه القطائف بتروح عند دكتور الاسنان كتير؟ عشان الحشو بيقع ",
    "مرة تيليفيزيون حب تيليفيزيونة قالها هاتي بوصة",
    "ليه الكومبيوتر بردان؟؟؟ عشان فاتح الويندوز",
    "مرة مدرس ماث خلف اتنين واحد اسم النبي حرصه وصاينه والتاني اسم النبي حارصه وكوزاينه",
    "مرة واحد قلقان والتاني بعد قليل",
    "مرة واحدة كتومة والتانية كبصلة",
    "مرة وردة بتدعي لوردة صاحبتها بالزهرية الصالحة"
    ,"مرة سبع بنات قعدوا مع بعض بقا اسمهم اسبوعنا"
    ,"مرة دبوس طلق مراته عشان بتشك فيه"
];
let click1 = true;
let i = 0;
function showj() {
    let ele=document.getElementById("j");
    let button=document.getElementById("jbtn");
    if(click1){
        button.textContent="Like it, Another one ^_^";
        ele.textContent=jokes[i];
        click1=false;
    } else {
        i=(i+1)%jokes.length;
        ele.textContent=jokes[i];
    }
}
